In [1]:
import numpy as np
import pandas as pd

### 用字典建表

In [7]:
raw_data = {'ID'        :['100',     '101',   '102',   '103',      '104'],
            'City'      :['Tokyo',   'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
            'Birth_year':[1990,      1989,    1992,    1997,       1982],
            'Name'      :['Hiroshi', 'Akiki', 'Yuki',  'Satoru',   'Steve']}
pd.DataFrame(raw_data, index=['a', 'b', 'c', 'd', 'e'])

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiki
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

### 用Numpy建表

In [8]:
raw_data = np.zeros(20).reshape(5, 4)
pd.DataFrame(data=raw_data, columns=['ID', 'City', 'Birth_year', 'Name'], index=['a', 'b', 'c', 'd', 'e'])

    ID  City  Birth_year  Name
a  0.0   0.0         0.0   0.0
b  0.0   0.0         0.0   0.0
c  0.0   0.0         0.0   0.0
d  0.0   0.0         0.0   0.0
e  0.0   0.0         0.0   0.0

### 用Pandas建表

In [9]:
pd.DataFrame(columns=range(4), index=range(5))

     0    1    2    3
0  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN